
# Por favor tente resolver o desafio sozinho, não pegue atalhos, tu consegue, é só colocar a cabeça para funcionar.

Execute a célula abaixo apenas uma vez.

In [1]:
%%bash

rm -rf /tmp/github; mkdir -p /tmp/github; cd /tmp/github
git clone https://github.com/romeritomorais/30-day-challenges-with-sql.git
sh /tmp/github/30-day-challenges-with-sql/challenges/utils/install-miniconda.sh > /dev/null 2>&1
sh /tmp/github/30-day-challenges-with-sql/challenges/utils/update-miniconda.sh > /dev/null 2>&1

Cloning into '30-day-challenges-with-sql'...

Nesse desafio eu preciso da contagem distinta dos dados da coluna `Customer.City` onde a contagem é >= a 2 linhas e por ordem alfabetica. 

resultado esperado:  

| City | numero_de_linhas 
|--------------:|--------------
| Berlin        |          2                  
| London        |          2                  
| Mountain View |          2                      
| Paris         |          2                
| Prague        |          2                
| São Paulo     |          2   

Na celula onde tem `%%sql` tu vai escrever a query abaixo dela, exemplo:  
```python
%%sql
select * from Customer
```

Para resolução tu podes usar a documentação do sqlite:https://www.sqlite.org/docs.html

In [2]:
%load_ext sql
%sql sqlite://///tmp/github/30-day-challenges-with-sql/challenges/utils/db/database.db

'Connected: @//tmp/github/30-day-challenges-with-sql/challenges/utils/db/database.db'

A solução pode ser encontrada usando uma deduplicação de dados pois não é possível utilizar o count no where. Caso seja necessário, é possível utilizar a clausula HAVING como no 2º Exemplo.

In [12]:
%%sql
with cte_city as (
select City, count(1) as numero_de_linhas
from customer 
group by city
)
select * from cte_city where numero_de_linhas >=2

 * sqlite://///tmp/github/30-day-challenges-with-sql/challenges/utils/db/database.db
Done.

[('Berlin', 2),
 ('London', 2),
 ('Mountain View', 2),
 ('Paris', 2),
 ('Prague', 2),
 ('São Paulo', 2)]

In [11]:
%%sql

select City, count(1) as numero_de_linhas
from customer 
group by city
having count(1) >=2

 * sqlite://///tmp/github/30-day-challenges-with-sql/challenges/utils/db/database.db
Done.

[('Berlin', 2),
 ('London', 2),
 ('Mountain View', 2),
 ('Paris', 2),
 ('Prague', 2),
 ('São Paulo', 2)]